In [1]:
pip install pyspark

Requirement already satisfied: pyspark in c:\users\toshiba\anaconda3\lib\site-packages (3.1.2)
Requirement already satisfied: py4j==0.10.9 in c:\users\toshiba\anaconda3\lib\site-packages (from pyspark) (0.10.9)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.3.1; however, version 22.0 is available.
You should consider upgrading via the 'C:\Users\Toshiba\anaconda3\python.exe -m pip install --upgrade pip' command.

In [ ]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('Spark').getOrCreate()

In [ ]:
spark

In [ ]:
from pyspark.sql.types import StructType, StructField, IntegerType, StringType

liste = [(1, "Joseph", "Forest", 32, 12000),
        (2, "Tommy", "Happy", 38, 13000),
        (3, "Thomas", "Horse", 30, 11000),
        (4, "Strato", "Wise", 37 , 15000)]

# columns = ["ID","Name","Surname","Age","Salary"]

# df = spark.createDataFrame(liste,columns)

list_schema = StructType([StructField("ID", IntegerType(), False),
                          StructField("Name", StringType(), True),
                          StructField("Surname", StringType(), True),
                          StructField("Age", IntegerType(), True),
                          StructField("Salary", IntegerType(), True)
                          ])

sample_df = spark.createDataFrame(data=liste, schema=list_schema)

In [ ]:
sample_df.printSchema()

root
 |-- ID: integer (nullable = false)
 |-- Name: string (nullable = true)
 |-- Surname: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [ ]:
sample_df.show()

+---+------+-------+---+------+
| ID|  Name|Surname|Age|Salary|
+---+------+-------+---+------+
|  1|Joseph| Forest| 32| 12000|
|  2| Tommy|  Happy| 38| 13000|
|  3|Thomas|  Horse| 30| 11000|
|  4|Strato|   Wise| 37| 15000|
+---+------+-------+---+------+

In [ ]:
sample_df.head(2)

[Row(ID=1, Name='Joseph', Surname='Forest', Age=32, Salary=12000),
 Row(ID=2, Name='Tommy', Surname='Happy', Age=38, Salary=13000)]

In [ ]:
sample_df.columns

['ID', 'Name', 'Surname', 'Age', 'Salary']

In [ ]:
sample_df.describe().show()

+-------+------------------+------+-------+------------------+-----------------+
|summary|                ID|  Name|Surname|               Age|           Salary|
+-------+------------------+------+-------+------------------+-----------------+
|  count|                 4|     4|      4|                 4|                4|
|   mean|               2.5|  null|   null|             34.25|          12750.0|
| stddev|1.2909944487358056|  null|   null|3.8622100754188224|1707.825127659933|
|    min|                 1|Joseph| Forest|                30|            11000|
|    max|                 4| Tommy|   Wise|                38|            15000|
+-------+------------------+------+-------+------------------+-----------------+

In [ ]:
sample_df.select(["Name","Salary"]).show()

+------+------+
|  Name|Salary|
+------+------+
|Joseph| 12000|
| Tommy| 13000|
|Thomas| 11000|
|Strato| 15000|
+------+------+

In [ ]:
sample_df.head(2)[0].asDict()#["Last Name"]

{'Age': 32, 'ID': 1, 'Name': 'Joseph', 'Salary': 12000, 'Surname': 'Forest'}

In [ ]:
sample_df.withColumn("new_salary", sample_df["Salary"]*1.2).show()

+---+------+-------+---+------+----------+
| ID|  Name|Surname|Age|Salary|new_salary|
+---+------+-------+---+------+----------+
|  1|Joseph| Forest| 32| 12000|   14400.0|
|  2| Tommy|  Happy| 38| 13000|   15600.0|
|  3|Thomas|  Horse| 30| 11000|   13200.0|
|  4|Strato|   Wise| 37| 15000|   18000.0|
+---+------+-------+---+------+----------+

In [ ]:
from pyspark.sql.functions import col, lit
sample_df.withColumn("new_age", (col("Age")+2).cast("String")).show()

+---+------+-------+---+------+-------+
| ID|  Name|Surname|Age|Salary|new_age|
+---+------+-------+---+------+-------+
|  1|Joseph| Forest| 32| 12000|     34|
|  2| Tommy|  Happy| 38| 13000|     40|
|  3|Thomas|  Horse| 30| 11000|     32|
|  4|Strato|   Wise| 37| 15000|     39|
+---+------+-------+---+------+-------+

In [ ]:
sample_df.withColumn("Country",lit("TR")).show()

+---+------+-------+---+------+-------+
| ID|  Name|Surname|Age|Salary|Country|
+---+------+-------+---+------+-------+
|  1|Joseph| Forest| 32| 12000|     TR|
|  2| Tommy|  Happy| 38| 13000|     TR|
|  3|Thomas|  Horse| 30| 11000|     TR|
|  4|Strato|   Wise| 37| 15000|     TR|
+---+------+-------+---+------+-------+

In [ ]:
sample_df.select(col("Name"),col("Surname"),lit("TR").alias("Country")).show()

+------+-------+-------+
|  Name|Surname|Country|
+------+-------+-------+
|Joseph| Forest|     TR|
| Tommy|  Happy|     TR|
|Thomas|  Horse|     TR|
|Strato|   Wise|     TR|
+------+-------+-------+

In [ ]:
from pyspark.sql.functions import when

sample_df.withColumn("Salary Level", when(col("Salary") >12000,lit("High")).otherwise(lit("Normal"))).show()

+---+------+-------+---+------+------------+
| ID|  Name|Surname|Age|Salary|Salary Level|
+---+------+-------+---+------+------------+
|  1|Joseph| Forest| 32| 12000|      Normal|
|  2| Tommy|  Happy| 38| 13000|        High|
|  3|Thomas|  Horse| 30| 11000|      Normal|
|  4|Strato|   Wise| 37| 15000|        High|
+---+------+-------+---+------+------------+

In [ ]:
sample_df.show()

+---+------+-------+---+------+
| ID|  Name|Surname|Age|Salary|
+---+------+-------+---+------+
|  1|Joseph| Forest| 32| 12000|
|  2| Tommy|  Happy| 38| 13000|
|  3|Thomas|  Horse| 30| 11000|
|  4|Strato|   Wise| 37| 15000|
+---+------+-------+---+------+

In [ ]:
sample_df.withColumnRenamed("Last Name","Surname").show()

+---+------+-------+---+------+
| ID|  Name|Surname|Age|Salary|
+---+------+-------+---+------+
|  1|Joseph| Forest| 32| 12000|
|  2| Tommy|  Happy| 38| 13000|
|  3|Thomas|  Horse| 30| 11000|
|  4|Strato|   Wise| 37| 15000|
+---+------+-------+---+------+

In [ ]:
sample_df.withColumnRenamed("Last Name","Surname") \
         .withColumnRenamed("ID", "Number").show()

+------+------+-------+---+------+
|Number|  Name|Surname|Age|Salary|
+------+------+-------+---+------+
|     1|Joseph| Forest| 32| 12000|
|     2| Tommy|  Happy| 38| 13000|
|     3|Thomas|  Horse| 30| 11000|
|     4|Strato|   Wise| 37| 15000|
+------+------+-------+---+------+

In [ ]:
sample_df.drop("ID").show()

+------+-------+---+------+
|  Name|Surname|Age|Salary|
+------+-------+---+------+
|Joseph| Forest| 32| 12000|
| Tommy|  Happy| 38| 13000|
|Thomas|  Horse| 30| 11000|
|Strato|   Wise| 37| 15000|
+------+-------+---+------+

In [ ]:
df_collect = sample_df.collect()

In [ ]:
df_collect#[1][2]

[Row(ID=1, Name='Joseph', Surname='Forest', Age=32, Salary=12000),
 Row(ID=2, Name='Tommy', Surname='Happy', Age=38, Salary=13000),
 Row(ID=3, Name='Thomas', Surname='Horse', Age=30, Salary=11000),
 Row(ID=4, Name='Strato', Surname='Wise', Age=37, Salary=15000)]

In [ ]:
for row in df_collect:
  print(row["Name"] + " " + row["Surname"])

Joseph Forest
Tommy Happy
Thomas Horse
Strato Wise

In [ ]:
sample_df.createOrReplaceTempView("personel")

In [ ]:
query = spark.sql("SELECT * FROM personel WHERE Salary>12000")
query.show()

+---+------+-------+---+------+
| ID|  Name|Surname|Age|Salary|
+---+------+-------+---+------+
|  2| Tommy|  Happy| 38| 13000|
|  4|Strato|   Wise| 37| 15000|
+---+------+-------+---+------+

In [ ]:
sample_df.filter("Age<38").show()

+---+------+-------+---+------+
| ID|  Name|Surname|Age|Salary|
+---+------+-------+---+------+
|  1|Joseph| Forest| 32| 12000|
|  3|Thomas|  Horse| 30| 11000|
|  4|Strato|   Wise| 37| 15000|
+---+------+-------+---+------+

In [ ]:
sample_df.filter(sample_df["Age"]<38).select(["Name", "Salary"]).show()

+------+------+
|  Name|Salary|
+------+------+
|Joseph| 12000|
|Thomas| 11000|
|Strato| 15000|
+------+------+

In [ ]:
sample_df.filter( (sample_df["Age"]<38) & (sample_df["Salary"]<15000) ).select(["Name", "Salary"]).show()

+------+------+
|  Name|Salary|
+------+------+
|Joseph| 12000|
|Thomas| 11000|
+------+------+

In [ ]:
sales_df = spark.read.csv("sales.csv",header=True, inferSchema=True)
sales_df.show()

+-------+-------+-----+
|Company| Person|Sales|
+-------+-------+-----+
|   GOOG|    Sam|200.0|
|   GOOG|Charlie|120.0|
|   GOOG|  Frank|340.0|
|   MSFT|   Tina|600.0|
|   MSFT|    Amy|124.0|
|   MSFT|Vanessa|243.0|
|     FB|   Carl|870.0|
|     FB|  Sarah|350.0|
|   APPL|   John|250.0|
|   APPL|  Linda|130.0|
|   APPL|   Mike|750.0|
|   APPL|  Chris|350.0|
+-------+-------+-----+

In [ ]:
sales_df.printSchema()

root
 |-- Company: string (nullable = true)
 |-- Person: string (nullable = true)
 |-- Sales: double (nullable = true)

In [ ]:
sales_df.groupBy("Company").max().show()

+-------+----------+
|Company|max(Sales)|
+-------+----------+
|   APPL|     750.0|
|   GOOG|     340.0|
|     FB|     870.0|
|   MSFT|     600.0|
+-------+----------+

In [ ]:
sales_df.agg({"sales":"mean"}).show()

+-----------------+
|       avg(sales)|
+-----------------+
|360.5833333333333|
+-----------------+

In [ ]:
groupdf = sales_df.groupBy("Company")
groupdf.agg({"sales":"max"}).show()

+-------+----------+
|Company|max(sales)|
+-------+----------+
|   APPL|     750.0|
|   GOOG|     340.0|
|     FB|     870.0|
|   MSFT|     600.0|
+-------+----------+

In [ ]:
sales_df.groupBy("Company").count().orderBy("count").show() ##  value_counts

+-------+-----+
|Company|count|
+-------+-----+
|     FB|    2|
|   GOOG|    3|
|   MSFT|    3|
|   APPL|    4|
+-------+-----+

In [ ]:
from pyspark.sql.functions import countDistinct, avg, stddev, format_number
sales_df.select(avg("sales").alias("Average Sales")).show()

+-----------------+
|    Average Sales|
+-----------------+
|360.5833333333333|
+-----------------+

In [ ]:
avg_sale = sales_df.select(avg("sales").alias("Average Sales"))
avg_sale.select(format_number("Average Sales",2).alias("Averga Sales")).show()

+------------+
|Averga Sales|
+------------+
|      360.58|
+------------+

In [ ]:
sales_df.orderBy("Sales").show()

+-------+-------+-----+
|Company| Person|Sales|
+-------+-------+-----+
|   GOOG|Charlie|120.0|
|   MSFT|    Amy|124.0|
|   APPL|  Linda|130.0|
|   GOOG|    Sam|200.0|
|   MSFT|Vanessa|243.0|
|   APPL|   John|250.0|
|   GOOG|  Frank|340.0|
|     FB|  Sarah|350.0|
|   APPL|  Chris|350.0|
|   MSFT|   Tina|600.0|
|   APPL|   Mike|750.0|
|     FB|   Carl|870.0|
+-------+-------+-----+

In [ ]:
sales_df.orderBy(sales_df["Sales"].desc()).show()

+-------+-------+-----+
|Company| Person|Sales|
+-------+-------+-----+
|     FB|   Carl|870.0|
|   APPL|   Mike|750.0|
|   MSFT|   Tina|600.0|
|     FB|  Sarah|350.0|
|   APPL|  Chris|350.0|
|   GOOG|  Frank|340.0|
|   APPL|   John|250.0|
|   MSFT|Vanessa|243.0|
|   GOOG|    Sam|200.0|
|   APPL|  Linda|130.0|
|   MSFT|    Amy|124.0|
|   GOOG|Charlie|120.0|
+-------+-------+-----+

In [ ]:
liste2 = [(1, "Joseph", "Forest", 32, None),
          (2, "Tommy", None,  38, 13000),
          (3, "Thomas", None, None, None),
          (4, "Strato", "Wise", 37 , 15000)]

columns2 = ["ID","Name","Surname","Age","Salary"]

missing_df = spark.createDataFrame(liste2,columns2)

In [ ]:
missing_df.show()

+---+------+-------+----+------+
| ID|  Name|Surname| Age|Salary|
+---+------+-------+----+------+
|  1|Joseph| Forest|  32|  null|
|  2| Tommy|   null|  38| 13000|
|  3|Thomas|   null|null|  null|
|  4|Strato|   Wise|  37| 15000|
+---+------+-------+----+------+

In [ ]:
missing_df.na.drop().show()

+---+------+-------+---+------+
| ID|  Name|Surname|Age|Salary|
+---+------+-------+---+------+
|  4|Strato|   Wise| 37| 15000|
+---+------+-------+---+------+

In [ ]:
missing_df.na.drop(subset=["Salary"]).show()

+---+------+-------+---+------+
| ID|  Name|Surname|Age|Salary|
+---+------+-------+---+------+
|  2| Tommy|   null| 38| 13000|
|  4|Strato|   Wise| 37| 15000|
+---+------+-------+---+------+

In [ ]:
missing_df.na.fill("fill value").show()

+---+------+----------+----+------+
| ID|  Name|   Surname| Age|Salary|
+---+------+----------+----+------+
|  1|Joseph|    Forest|  32|  null|
|  2| Tommy|fill value|  38| 13000|
|  3|Thomas|fill value|null|  null|
|  4|Strato|      Wise|  37| 15000|
+---+------+----------+----+------+

In [ ]:
missing_df.na.fill(0).show()

+---+------+-------+---+------+
| ID|  Name|Surname|Age|Salary|
+---+------+-------+---+------+
|  1|Joseph| Forest| 32|     0|
|  2| Tommy|   null| 38| 13000|
|  3|Thomas|   null|  0|     0|
|  4|Strato|   Wise| 37| 15000|
+---+------+-------+---+------+

In [ ]:
from pyspark.sql.functions import mean
avg_sal = missing_df.select(mean("Salary")).collect()
mean_sal = avg_sal[0][0]

In [ ]:
missing_df.na.fill(mean_sal, subset="Salary").show()

+---+------+-------+----+------+
| ID|  Name|Surname| Age|Salary|
+---+------+-------+----+------+
|  1|Joseph| Forest|  32| 14000|
|  2| Tommy|   null|  38| 13000|
|  3|Thomas|   null|null| 14000|
|  4|Strato|   Wise|  37| 15000|
+---+------+-------+----+------+

In [ ]:
stock_df = spark.read.csv("apple.csv", header=True, inferSchema=True )
stock_df.show()

+----------+------------------+------------------+------------------+------------------+---------+------------------+
|      Date|              Open|              High|               Low|             Close|   Volume|         Adj Close|
+----------+------------------+------------------+------------------+------------------+---------+------------------+
|2010-01-04|        213.429998|        214.499996|212.38000099999996|        214.009998|123432400|         27.727039|
|2010-01-05|        214.599998|        215.589994|        213.249994|        214.379993|150476200|27.774976000000002|
|2010-01-06|        214.379993|            215.23|        210.750004|        210.969995|138040000|27.333178000000004|
|2010-01-07|            211.75|        212.000006|        209.050005|            210.58|119282800|          27.28265|
|2010-01-08|        210.299994|        212.000006|209.06000500000002|211.98000499999998|111902700|         27.464034|
|2010-01-11|212.79999700000002|        213.000002|        208.450005|210.11000299999998|115557400|         27.221758|
|2010-01-12|209.18999499999998|209.76999500000002|        206.419998|        207.720001|148614900|          26.91211|
|2010-01-13|        207.870005|210.92999500000002|        204.099998|        210.650002|151473000|          27.29172|
|2010-01-14|210.11000299999998|210.45999700000002|        209.020004|            209.43|108223500|         27.133657|
|2010-01-15|210.92999500000002|211.59999700000003|        205.869999|            205.93|148516900|26.680197999999997|
|2010-01-19|        208.330002|215.18999900000003|        207.240004|        215.039995|182501900|27.860484999999997|
|2010-01-20|        214.910006|        215.549994|        209.500002|            211.73|153038200|         27.431644|
|2010-01-21|        212.079994|213.30999599999998|        207.210003|        208.069996|152038600|         26.957455|
|2010-01-22|206.78000600000001|        207.499996|            197.16|            197.75|220441900|         25.620401|
|2010-01-25|202.51000200000001|        204.699999|        200.190002|        203.070002|266424900|26.309658000000002|
|2010-01-26|205.95000100000001|        213.710005|        202.580004|        205.940001|466777500|         26.681494|
|2010-01-27|        206.849995|            210.58|        199.530001|        207.880005|430642100|26.932840000000002|
|2010-01-28|        204.930004|        205.500004|        198.699995|        199.289995|293375600|25.819922000000002|
|2010-01-29|        201.079996|        202.199995|        190.250002|        192.060003|311488100|         24.883208|
|2010-02-01|192.36999699999998|             196.0|191.29999899999999|        194.729998|187469100|         25.229131|
+----------+------------------+------------------+------------------+------------------+---------+------------------+
only showing top 20 rows

In [ ]:
from pyspark.sql.functions import year

stock_df.select(year("Date")).show()

+----------+
|year(Date)|
+----------+
|      2010|
|      2010|
|      2010|
|      2010|
|      2010|
|      2010|
|      2010|
|      2010|
|      2010|
|      2010|
|      2010|
|      2010|
|      2010|
|      2010|
|      2010|
|      2010|
|      2010|
|      2010|
|      2010|
|      2010|
+----------+
only showing top 20 rows

In [ ]:
new_stock = stock_df.withColumn("Year", year("Date")).select(["Year", "Close"])

In [ ]:
new_stock.groupBy("Year").mean().select(["Year", "avg(Close)"]).withColumnRenamed("avg(Close)", "Average Close").orderBy("Year").show()

+----+------------------+
|Year|     Average Close|
+----+------------------+
|2010| 259.8424600000002|
|2011|364.00432532142867|
|2012| 576.0497195640002|
|2013| 472.6348802857143|
|2014| 295.4023416507935|
|2015|120.03999980555547|
|2016|104.60400786904763|
+----+------------------+